//  1. Ознайомитися з визначенням: атомарна змінна, атомарна операція,
//     неблокуючий алгоритм. Ознайомитися з деталями атомарності в обраній
//     мові програмування.
//  2. Надати в протоколі роботи опис того, як саме досягається справжня
//	   атомарність операцій в обраній студентом мові програмування.
//  3. Виконати завдання за варіантом без використанням паралелізації.
//	   Заміряти час виконання завдання.
// 
//			24. Знайти кількість елементів, кратних 19, і найменший такий елемент. 
// 
//  4. Виконати завдання за варіантом з використанням блокуючих примітивів
//	   синхронізації. Заміряти час виконання завдання.
//  5. Виконати завдання за варіантом з використанням атомарних змінних та
//	   CAS\CMPXCHNG операцій (більш високорівнені функції, що
//	   абстрагують дані операції, не приймаються для використання в даній
//	   роботі). Заміряти час виконання завдання.
//  6. Повторити пункти 2 – 4 з використанням різної розмірності даних та
//	   фіксованою кількістю потоків виконання.
//  7. В протокол занести отримані для пункту 5 результати у вигляді графіків
//	   залежності часу від кількості даних, надати порівняльний аналіз
//	   блокуючого та неблокуючого алгоритму з використання атомарних
//	   операцій.
//  8. Надати висновок, що повинен містити аналіз отриманих результатів.

#include <iostream>
#include <vector>
#include <algorithm>
#include <random>

using namespace std;

void generate_random_numbers(vector<int> &arr, int amount)
{
	random_device rd;
	mt19937 engine(rd());
	uniform_int_distribution<> dist(0, 10000);

	for (int i = 0; i < amount; i++)
	{
		arr.push_back(dist(engine));
	}
}

void single_thread_task_function(vector<int> &arr, int &amount, int &min_element)
{
	for (int number : arr)
	{
		if (number % 19 == 0)
		{
			amount++;

			if (number < min_element)
			{
				min_element = number;
			}
		}
	}
}

int main()
{
	int numbers_amount = 0;

	cin >> numbers_amount;

	vector<int> arr = {};
	generate_random_numbers(arr, numbers_amount);

	int amount = 0, min_element = *(max_element(arr.begin(), arr.end()));

	single_thread_task_function(arr, amount, min_element);

	cout << amount << "\n" << min_element;
}